perf-test/results/01-run2-jmeter.log
2026-08-18 13:10:06,603 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-18 13:10:06,613 INFO o.a.j.JMeter: Loading user properties from: D:\tools\apache-jmeter-5.6.3\bin\user.properties
2026-08-18 13:10:06,613 INFO o.a.j.JMeter: Loading system properties from: D:\tools\apache-jmeter-5.6.3\bin\system.properties
2026-08-18 13:10:06,617 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-18 13:10:06,617 INFO o.a.j.JMeter: Version 5.6.3
2026-08-18 13:10:06,617 INFO o.a.j.JMeter: java.version=21.0.10
2026-08-18 13:10:06,617 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-08-18 13:10:06,617 INFO o.a.j.JMeter: os.name=Windows 11
2026-08-18 13:10:06,617 INFO o.a.j.JMeter: os.arch=amd64
2026-08-18 13:10:06,619 INFO o.a.j.JMeter: os.version=10.0
2026-08-18 13:10:06,619 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-18 13:10:06,619 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-18 13:10:06,619 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-18 13:10:06,619 INFO o.a.j.JMeter: Available Processors =24
2026-08-18 13:10:06,623 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-18 13:10:06,623 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-18 13:10:06,623 INFO o.a.j.JMeter: JMeterHome=D:\tools\apache-jmeter-5.6.3
2026-08-18 13:10:06,623 INFO o.a.j.JMeter: user.dir  =D:\sm-console\perf-test
2026-08-18 13:10:06,623 INFO o.a.j.JMeter: PWD       =D:\sm-console\perf-test
2026-08-18 13:10:11,551 INFO o.a.j.JMeter: IP: 192.168.56.1 Name: ICT02-15 FullName: ICT02-15
2026-08-18 13:10:11,559 INFO o.a.j.s.FileServer: Default base='D:\sm-console\perf-test'
2026-08-18 13:10:11,560 INFO o.a.j.s.FileServer: Set new base='D:\sm-console\perf-test'
2026-08-18 13:10:11,691 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-18 13:10:11,710 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-18 13:10:11,712 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-18 13:10:11,714 INFO o.a.j.s.SaveService: Loading file: 01-optimistic-lock.jmx
2026-08-18 13:10:11,749 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:10:11,757 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:10:11,758 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:10:11,758 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 13:10:11,758 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-18 13:10:11,758 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-18 13:10:11,781 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-18 13:10:11,794 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-18 13:10:11,794 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 13:10:11,794 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 13:10:11,797 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-18 13:10:11,797 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-18 13:10:11,859 INFO o.a.j.JMeter: Running test (1787026211859)
2026-08-18 13:10:11,872 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 5 Admins - Same Inquiry, Same Version
2026-08-18 13:10:11,872 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group 5 Admins - Same Inquiry, Same Version.
2026-08-18 13:10:11,872 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-18 13:10:11,872 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=0 delayedStart=false
2026-08-18 13:10:11,877 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-18 13:10:11,877 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-18 13:10:11,883 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-4
2026-08-18 13:10:11,883 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-5
2026-08-18 13:10:11,883 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-2
2026-08-18 13:10:11,883 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-3
2026-08-18 13:10:11,883 INFO o.a.j.t.JMeterThread: Thread started: 5 Admins - Same Inquiry, Same Version 1-1
2026-08-18 13:10:11,886 INFO o.a.j.s.FileServer: Stored: data/admins.csv
2026-08-18 13:10:11,907 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = ICT02-15
2026-08-18 13:10:11,910 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-18 13:10:11,911 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-18 13:10:11,911 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-18 13:10:11,911 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-18 13:10:11,911 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-2
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-2
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-4
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-3
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-3
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-4
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-5
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread is done: 5 Admins - Same Inquiry, Same Version 1-1
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-5
2026-08-18 13:10:12,066 INFO o.a.j.t.JMeterThread: Thread finished: 5 Admins - Same Inquiry, Same Version 1-1
2026-08-18 13:10:12,066 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-18 13:10:12,067 INFO o.a.j.s.FileServer: Close: data/admins.csv
2026-08-18 13:10:12,068 INFO o.a.j.r.Summariser: summary =     10 in 00:00:00 =   48.1/s Avg:    52 Min:    20 Max:    85 Err:     4 (40.00%)